InformationRegisters/Дерби.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>Дерби</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Противник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Дерби/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура КомандаДербиОтчет(Команда)
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		ОткрытьФорму("Отчет.Дерби.Форма");
	Иначе
		ДанныеЗаполнения = Новый Массив;
		ДанныеЗаполнения.Добавить(Элементы.Список.ТекущиеДанные.Команда);
		ДанныеЗаполнения.Добавить(Элементы.Список.ТекущиеДанные.Противник);
		НаКлиенте.ОбработкаКомандыОткрытьФорму("Отчет.Дерби.Форма", Новый Структура("Команды", ДанныеЗаполнения), ЭтаФорма);
	КонецЕсли;
КонецПроцедуры
